Revit 2025 API
AreaElemType Enumeration
An enumerated type to store type of AreaElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum AreaElemType
Public Enumeration AreaElemType
public enum class AreaElemType
type AreaElemType
Members
Member name | Value | Description
GrossArea | 0 | Gross Area Scheme - only 2 types of spaces (internal and external).
BOMAArea | 1 | Office Area Scheme - uses BOMA rules for space classification.
See Also
Reference
Autodesk.Revit.DB Namespace